Repository: Dharunikaramprakash/TechM_COE
Catalog: FLUTTER/lib/l10n/app_*.arb
Languages: es

# title
source: Pet Adoption
es: Adopción de Mascotas

# welcomeMessage
source: Welcome to iAdopt The Pet Adoption App!
es: ¡Bienvenido a la aplicación de adopción de mascotas!

# addPet
source: Donate a Pet
es: Agregar Mascota

# addedSuccessfully
source: Pet added successfully!
es: ¡Mascota agregada con éxito!

# errorLoadingPets
source: Error loading pets. Please try again.
es: Error al cargar mascotas. Inténtalo de nuevo.

source: No pets available.
es: No hay mascotas disponibles.

source: Name
es: Nombre

source: Breed
es: Raza

source: Image URL
es: URL de la imagen

source: Description
es: Descripción

# enterName
source: Enter pet's name
es: Ingrese el nombre de la mascota

# enterBreed
source: Enter pet's breed
es: Ingrese la raza de la mascota

source: Enter image URL
es: Ingrese la URL de la imagen

# enterDescription
source: Enter pet's description
es: Ingrese la descripción de la mascota

# chooseLanguage
source: Choose a Language
es: Elige un idioma

# spanish
source: Español
es: Spanish

# mainMenu
source: iAdopt
es: Menú Principal

source: Go to Home
es: Ir a Inicio

# availablePets
source: Available Pets for Adoption
es: Mascotas Disponibles

source: Pet Name
es: Nombre de la Mascota

# petBreed
source: Breed
es: Raza

# petDescription
source: Description
es: Descripción

source: Select Image
es: Seleccionar Imagen

source: No image selected
es: Ninguna imagen seleccionada

# fillAllFields
source: Please fill all fields and select an image
es: Por favor, complete todos los campos y seleccione una imagen

# imageUploadFailed
source: Failed to upload image
es: Error al subir la imagen

# giverName
source: Giver's Name
es: Nombre del Dador

# giverAddress
source: Giver's Address
es: Dirección del Dador

# giverContact
source: Giver's Contact
es: Contacto del Dador

source: Price
es: Precio

# noDescription
source: No description available
es: No hay descripción disponible

source: Back
es: Atrás
